run/moore1973_NozzleA/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  3.0.x                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile                                                                        
{                                                                               
    version     2.0;                                                            
    format      ascii;                                                          
    class       dictionary;                                                     
    object      blockMeshDict;                                                  
}                                                                               
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.000000; 

vertices 
( 
    (0.000000 0.000000 0.000000)
    (0.050000 0.000000 0.000000)
    (0.050000 0.010000 0.000000)
    (0.000000 0.010000 0.000000)
    (0.000000 0.000000 0.037850)
    (0.050000 0.000000 0.037850)
    (0.050000 0.010000 0.037850)
    (0.000000 0.010000 0.037850)
    (0.250000 0.000000 0.006350)
    (0.250000 0.010000 0.006350)
    (0.250000 0.000000 0.037850)
    (0.250000 0.010000 0.037850)
    (0.750000 0.000000 -0.019150)
    (0.750000 0.010000 -0.019150)
    (0.750000 0.000000 0.037850)
    (0.750000 0.010000 0.037850)
); 

blocks 
( 
    hex (0 1 2 3 4 5 6 7)     (8 1 100) simpleGrading (1.000000 1.000000 75.000000) 
    hex (1 8 9 2 5 10 11 6)     (30 1 100) simpleGrading (1.000000 5.000000 75.000000) 
    hex (8 12 13 9 10 14 15 11)     (150 1 100) simpleGrading (1.000000 0.500000 75.000000) 
); 

edges 
( 
); 

boundary 
( 
    inlet 
    { 
        type patch; 
        faces 
        ( 
            (3 0 4 7) 
        ); 
    } 

    outlet 
    { 
        type patch; 
        faces 
        ( 
            (12 13 15 14) 
        ); 
    } 

    walls 
    { 
        type wall; 
        faces 
        ( 
            (3 2 1 0) 
            (1 2 9 8) 
            (8 9 13 12) 
        ); 
    } 

    longitudinal_symmetry 
    { 
        type symmetryPlane; 
        faces 
        ( 
            (4 5 6 7) 
            (5 10 11 6) 
            (10 14 15 11) 
        ); 
    } 
    lateral_sides 
    { 
        type empty; 
        faces 
        ( 
            (3 7 6 2) 
            (2 6 11 9) 
            (9 11 15 13) 
            (0 1 5 4) 
            (1 8 10 5) 
            (8 12 14 10) 
        ); 
    } 
); 
 
mergePatchPairs 
( 
); 
 
// ************************************************************************* // 
