run/moore1973_NozzleA/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            inletOutlet;
	inletValue	uniform (0 0 0);
	value		$internalField;
    }
    walls
    {
        type            noSlip;
    }
    longitudinal_symmetry
    {
        type            symmetryPlane;
    }
    lateral_sides
    {
        type            empty;
    }
}


// ************************************************************************* //
