run/moore1973_NozzleA/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 350.0;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        value           uniform 354.6;
        T0              uniform 354.6;
        gamma           1.32;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    longitudinal_symmetry
    {
        type            symmetryPlane;
    }
    lateral_sides
    {
        type            empty;
    }
}


// ************************************************************************* //
