run/moore1973_NozzleA/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.019;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue	0.019;
        value           uniform 0.019;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.019;
        value           uniform 0.019;
    }
    walls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.045;
        E               9.0;
        value           uniform 0.0;
    }
    longitudinal_symmetry
    {
        type            symmetryPlane;
    }
    lateral_sides
    {
        type            empty;
    }
}


// ************************************************************************* //
