run/moore1973_NozzleA/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0045375;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0045375;
        value           uniform 0.0045375;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0045375;
        value           uniform 0.0045375;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }
    longitudinal_symmetry
    {
        type            symmetryPlane;
    }
    lateral_sides
    {
        type            empty;
    }
}


// ************************************************************************* //
